# ExtraOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFamilyInstanceExtrusionExportResults..::..ExtraOffset Property
IFCFamilyInstanceExtrusionExportResults Class See Also
---
The extra offset determined from the geometry of the family instance.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public XYZ ExtraOffset { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ExtraOffset As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ ExtraOffset {
	XYZ^ get ();
}
```

# See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace